[
    {
        "code": "G 0.1",
        "title": "Tuli",
        "combined_title": "G 0.1: Tuli",
        "description": "<p>Tuli võib tekitada otseseid raskeid kahjustusi inimestele, hoonetele ja sisustusele ja samuti laiaulatuslikke kaudseid kahjustusi infotehnoloogiale.</p><p>Põleng tekib mitte ainult hooletust ümberkäimisest tulega, vaid ka elektriseadmete mittesihipärasel kasutamisel. Põlengu põhjuseks võib olla elektriseadmete tehniline rike.</p><p>Tule levikut võib muuhulgas soodustada</p><ul><li>tuletõkkeuste lahtihoidmine kiiluga;</li><li>tuleohtliku materjali (näiteks vanapaberi) halb ladustus;</li><li>tuleohutusnormide ja -eeskirjade eiramine;</li><li>tulesignalisatsiooni (näiteks suitsuandurite) puudumine;</li><li>käsikustutite või automaatkustutusseadmete või nende kasutusvalmiduse puudumine;</li><li>puudulik preventiivne tuleohutus (näiteks tuletõkete puudumine kaablitrassidel).</li></ul><p><b>Näiteid</b></p><ul><li>Üha juhtub, et elektrilised väikeseadmed, näiteks kohvimasinad või lauavalgustid, põhjustavad põlenguid väära ühendamise või paigalduse tõttu.</li><li>Ühe asutuse serveriruumis toimus tulekahju ning sellest olid mõjutatud üle 100 asutuse, kes nende teenuseid igapäevaselt kasutasid. Katkestus kestis nädal aega, samal ajal teiste asutuste töö seisis.</li><li>Näiteks kustutusveega tekitatavad kahjustused ei piirdu ainult põlengualaga, vaid võivad ilmneda ka hoone lähimates naaberosades. Tulekahju kustutamise tulemusel tekkivad aurud võivad ventilatsioonisüsteemi kaudu levimisel tekitada kahjustusi ka hoone kaugemas osas asuvatele tundlikele elektroonikaseadmetele.</li></ul>"
    },
    {
        "code": "G 0.2",
        "title": "Halvad keskkonnatingimused",
        "combined_title": "G 0.2: Halvad keskkonnatingimused",
        "description": "<p>Ebasobivad kliimatingimused (näiteks kuumus, külm, õhuniiskus) ja kliimatingimuste sage kõikumine võivad põhjustada tehniliste komponentide väärtalitlust, salvestuskandjate riknemist ja võivad viia ka selleni, et inimesed ei saa enam töötada, või isegi põhjustada traumasid või surma.</p><p>Nii inimesel kui seadmetel on normaalseks tööks vajalik temperatuurivahemik, millest kõrgem või madalam ümbrusetemperatuur võib tekitada tööseisakuid, tõrkeid või väljalangemisi.</p><p>Keskkonnatingimused võivad muuhulgas põhjustada järgmisi kahjustusi:</p><ul><li>lubatust kõrgem temperatuur võib kahjustada magnetilisi andmekandjaid;</li><li>liigne niiskus võib häirida seadmete tööd ja neid kahjustada;</li><li>üleminekuperioodil (kevadel, sügisel) võib suur temperatuuri kõikumine viia lubatava õhuniiskuse ületamiseni tugeva jahutuse tõttu;</li><li>rohke tolm IT-süsteemides võib viia kuumusest tingitud seisakuni.</li></ul><p><b>Näiteid</b></p><ul><li>Suvised kõrgtemperatuurid ja ebapiisav jahutus võivad põhjustada IT-seadmete tõrkeid.</li><li>Tihti avatakse tuulutamiseks lubamatult serveriruumi aken, mis võib kliimaseadmed üle koormata või liigset õhuniiskust põhjustada.</li></ul>"
    },
    {
        "code": "G 0.3",
        "title": "Vesi",
        "combined_title": "G 0.3: Vesi",
        "description": "<p>Vesi võib rikkuda analoog- ja digitaalkandjatel talletatava ja samuti IT-süsteemide põhimälus oleva teabe terviklust ja käideldavust.</p><p>Vesi võib põhjustada toiteseadmete või muude IT-komponentide kahjustusi või väljalangemisi lühise, mehaanilise kahjustuse, rooste vms tõttu.</p><p>Väga suuri kahjustusi võib sissetungiv vesi tekitada siis, kui hoone tsentraalsed tehnosüsteemid (peakilp, telefonijaam, andmesüsteemid) on paigutatud keldriruumidesse, kus pole sõltumatut kanalisatsiooni.</p><p>Kontrollimatut vee pääsu hoonetesse või ruumidesse võivad põhjustada</p><ul><li>veevarustuse või kanalisatsiooni tõrked;</li><li>küttesüsteemi defektid;</li><li>veeühendusega kliimaseadme rikked;</li><li>sprinklerisüsteemi rikked;</li><li>kustutusvesi tule tõrjumisel;</li><li>veega sabotaaž, näiteks kraanide avamise ja äravoolu sulgemisega.</li></ul><p><b>Näide</b></p><ul><li>Serveriruumi läbis veetorustik, ruumis ei olnud veetaseme/niiskuse andureid ning veetorustiku leket ei olnud võimalik tuvastada enne kui tekkis lühis ning seadmed lakkasid töötamast.</li></ul>"
    },
    {
        "code": "G 0.4",
        "title": "Määrdumine, tolm, korrosioon",
        "combined_title": "G 0.4: Määrdumine, tolm, korrosioon",
        "description": "<p>Saaste, tolm või korrosioon võivad viia IT-komponentide ja toiteseadmete väljalangemiseni või kahjustusteni, mis ohustavad korrakohast infotöötlust.</p><p>Mehaaniliselt töötavate komponentide (kõvakettad, irdkettad, DVD-draivid, printerid, skannerid, protsessorite ja toiteplokkide ventilaatorid) määrdumine, tolm ja korrosioon võib viia tõrke või väljalangemiseni.</p><p>Seadmeis ja taristus tekkida võiv rooste võib põhjustada veel ka kaudseid kahjustusi. Näiteks võib roostetanud torudest välja pääseda vesi (vt G 0.3 Vesi).</p><p>Tolmu ja saastet võivad suurel määral tekitada näiteks järgmised tegevused:</p><ul><li>tööd seintel, topeltpõrandatel või muudel hooneosadel;</li><li>riistvara ümberkujundustööd;</li><li>seadmete lahtipakkimine (näiteks vahtpolüstüreentäidisest).</li></ul><p><b>Näiteid</b></p><ul><li>Serveriruumis hoiustati pabereid, erinevate seadmete karpe ning seda ei oldud puhastatud pikka aega, puhastama jätmisest ja paberite ning karpide hoiustamisest tekkinud tolm seiskas serverid.</li><li>Tahvli seinaleriputamiseks büroos puuris tehnikatalitus seina sisse auke. Töötaja lahkus selle ajaks ruumist. Kui ta tagasi tuli, avastas ta, et arvuti enam ei tööta. Põhjuseks oli puurimistolm, mis tungis arvuti toiteplokki.</li></ul>"
    },
    {
        "code": "G 0.5",
        "title": "Loodusõnnetused",
        "combined_title": "G 0.5: Loodusõnnetused",
        "description": "<p>Loodusõnnetus on loodusemuutus, millel on hävitav toime inimestele ja taristule.</p><p>Uputusohtlikel aladel ohustab arvutikeskusi tihti vee kontrollimatu tungimine hoonesse (üleujutus või põhjaveehorisondi tõus).</p><p>Sõltumatult loodusõnnetuse liigist on ka neist otseselt puudutamata aladel toitesüsteemide, sideühenduste või IT-komponentide kahjustuse või väljalangemise oht.Hoone tsentraalsete tehnosüsteemide (elektri, telefoni, andmeside peajaotusseadmete) väljalangemine võib tuua kaasa eriti suuri kahjustusi.</p><p>Ulatuslik tõkestusala võib takistada käitus- ja hooldepersonali juurdepääsu taristule.</p><p><b>Näiteid</b></p><ul><li>Eesti lääneosas asuva ettevõtte arvutikeskus asus keldrikorrusel, kuhu üleujutuse käigus tungis vesi. Tekitatud kahju ulatus mitmesaja tuhande euroni ja ei olnud kindlustusega kaetud.</li><li>Eesti kirdeosa tabas torm, mille tõttu seiskus mitme kohaliku omavalitsuse töö, kuna elektriliinid olid saanud mitmest kohast kannatada ning nende taastamiseks kulus mitu päeva.</li></ul>"
    },
    {
        "code": "G 0.6",
        "title": "Keskkonnaõnnetused",
        "combined_title": "G 0.6: Keskkonnaõnnetused",
        "description": "<p>Asutus või ettevõte võib saada kahjustusi, kui ta läheduses toimub tõsine õnnetus, näiteks põleng, plahvatus, mürgiste ainete leke või ohtlik kiirgus.</p><p>Ohtu tekitab seejuures mitte ainult sündmus ise, vaid ka temast tulenevad tegevused, näiteks tõkestused või päästetoimingud.</p><p>Omandit võivad seejuures otseselt puudutada vältimis- või päästemeetmed. Niisugused meetmed võivad viia ka selleni, et töötajad ei pääse oma töökohtadele või et personal tuleb evakueerida.</p><p>Organisatsiooni omandit võivad ähvardada mitmesugused ta keskkonnast lähtuvad ohud, eelkõige</p><ul><li>liiklusest (tänava-, raudtee-, õhu-, veeliiklusest);</li><li>naaberettevõttest;</li><li>elamurajoonist.</li></ul><p><b>Näide</b></p><ul><li>Asutus koos oma serveriruumidega asus vähem kui 200 meetri kaugusel raudteest. Raudteel toimus õnnetus, mille tulemusena sõitis rong rööbastelt maha ja kütust sisaldanud tsisternid paiskusid pikali. Tsisternidest välja voolanud kütus süttis ning plahvatas.</li></ul>"
    },
    {
        "code": "G 0.7",
        "title": "Suurüritused",
        "combined_title": "G 0.7: Suurüritused",
        "description": "<p>Suurüritused võivad viia asutuse või ettevõtte igapäevase töö häirimiseni. Suurüritustega kaasnev müra ja liikumispiirangud võivad töötajaid häirida. Suurüritustega kaasnevad võimalikud korratused võivad viia vandalismini või vägivalla kasutamiseni personali vastu.</p><p>Suurürituse hulka kuuluvad näiteks</p><ul><li>tänavapidustused;</li><li>kontserdid;</li><li>spordiüritused;</li><li>demonstratsioonid.</li></ul><p><b>Näiteid</b></p><ul><li>Arvutikeskuse lähedal toimunud demonstratsioon eskaleerus vägivallaaktideni. Arvutikeskuse aknast sisse tunginud demonstrant kasutas juhust tähtsaid andmeid sisaldava arvuti varguseks.</li><li>Suurlaada rajamisel vigastati eksikombel üht elektrijuhet, põhjustades selle juhtme kaudu toidetavas arvutikeskuses katkestuse.</li></ul>"
    },
    {
        "code": "G 0.8",
        "title": "Toitekatkestus või toitehäire",
        "combined_title": "G 0.8: Toitekatkestus või toitehäire",
        "description": "<p>Hoolimata suurest varustuskindlusest tuleb üha ette jaotussüsteemi operaatorite või energiatootjate tekitatud voolukatkestusi.</p><p>Isegi lühiajalised ja inimesele märkamatud elektrikatkestused võivad häirida IT-tööd.</p><p>Lisaks katkestustele võib ka näiteks ülepinge tekitada elektriseadmete väärtalitlust või neid isegi kahjustada.</p><p>Elektritoitest sõltuvad mitte ainult nähtavalolevad otsesed voolutarbijad (arvutid, valgustid jms), vaid ka paljud taristusüsteemid, näiteks</p><ul><li>ventilatsioon;</li><li>kliimatehnika;</li><li>ohusignalisaatorid;</li><li>turvalüüsid;</li><li>uste sulgemisautomaatika;</li><li>sprinklerisüsteemid.</li></ul><p><b>Näiteid</b></p><ul><li>Ühes arvutikeskuses ei lülitanud puhvertoiteseade enda rikke tõttu pärast lühikest toitekatkestust toidet tagasi normaalsele tööviisile. Akude tühjenemisel (umbes 40 minutiga) seiskusid kõik selle serverisaali arvutid.</li></ul>"
    },
    {
        "code": "G 0.9",
        "title": "Sidevõrkude tõrge või häire",
        "combined_title": "G 0.9: Sidevõrkude tõrge või häire",
        "description": "<p>Tänapäeva äriprotsessid vajavad korras sideühendusi nagu Internet, telefon, faks, meil.</p><p>Pikemaajalised häired sideühendustes võivad otseselt ohustada ohustada vajaliku teabe edastust, infopäringute saatmist teistele asutustele ja lepingute sõlmimist.</p><p>Kui laivõrguga ühendatud IT-süsteemides käitatakse aegkriitilisi rakendusi, võivad otsesed ja kaudsed kahjud võrgu väljalangemisel ja asendusvõimaluste puudumisel (näiteks teise sidevõrgu abil) olla suured.</p><p>Samasugused probleemid võivad tekkida vajalike sidevõrkude häirete korral, ilma täieliku välja-langemiseta. Sideühendustes võib ilmneda näiteks suurem vigade arv või muu kvaliteedidefekt.</p>"
    },
    {
        "code": "G 0.10",
        "title": "Tehnovõrkude tõrge või häire",
        "combined_title": "G 0.10: Tehnovõrkude tõrge või häire",
        "description": "<p>Hoone tehnovõrgud on kõigi äriprotsesside, sealhulgas infotehnoloogia alustalad.</p><p>Tehnovõrgu väljalangemine või häiring võib viia muuhulgas selleni, et inimesed ei saa enam hoones töötada või et kahjustub IT-töö ning seega ka infotöötlus. Võrgud sõltuvad mitmel eri määral üksteisest, niisiis võivad häired ühe võrgu töös mõjutada ka teisi.</p><p>Tehnovõrgud on näiteks</p><ul><li>elektritoide;</li><li>telefon;</li><li>jahutus;</li><li>küte ja ventilatsioon;</li><li>vesi ja kanalisatsioon;</li><li>kustutusveevarustus;</li><li>gaas;</li><li>signalisatsiooni- ja juhtimisseadmed (näiteks valve, tuleohutus, hoonetehnika juhtimine);</li><li>pääsusüsteem.</li></ul><p><b>Näiteid</b></p><ul><li>Kütte või ventilatsiooni väljalangemise tulemusena võib kõigil töötajail tekkida vajadus hoonest lahkuda. Teatud juhtudel võib see tuua kaasa suure kahju.</li><li>Elektritoite katkemine mõjutab mitte ainult otseselt infotehnoloogiat, vaid ka kõiki teisi võrke, milles on elektrilist juhtimis- ja reguleerimistehnikat. Isegi kanalisatsioonis võivad teatud juhtudel olla elektrilised tõmbepumbad.</li></ul>"
    },
    {
        "code": "G 0.11",
        "title": "Teenusetarnete tõrge või häire",
        "combined_title": "G 0.11: Teenusetarnete tõrge või häire",
        "description": "<p>Organisatsiooni töö sõltub enamasti teenuseandjatest, näiteks tarnijatest või väljasttellimise pakkujatest. Nende täielik väljalangemine võib tugevalt mõjutada tegevuse jätkuvust, eriti elutähtsate äriprotsesside puhul.</p><p>Probleeme võib tekkida, kui teenustaja teenus ei vasta teenusetellija kvaliteedinõuetele. Mõnikord võib katkenud protsesside ennistamine olla väga raske, näiteks kui neid protsesse ei ole piisavalt dokumenteeritud või kui seniselt teenusandjalt ei saa selleks abi.</p><p>Väljalangemiste põhjusi on mitmesuguseid, näiteks</p><ul><li>teenustaja või tarnija pankrot;</li><li>temaga sõlmitud lepingu temapoolne lõpetamine;</li><li>tegevusprobleemid näiteks loodusjõudude tõttu või personali väljalangemisel, samuti teenustaja IT-süsteemide või sideühenduste väljalangemisel.</li></ul><p><b>Näiteid</b></p><ul><li>Ettevõtte server oli installeeritud välise teenustaja arvutikeskuses. Pärast üht selle arvutikeskuse põlengut ei olnud ettevõtte rahandusosakond enam töövõimeline ning ettevõte sai tunduvat rahalist kahju.</li><li>Ühes ettevõtte sõltus täppisajastuslik tootmine töövahendite tarnimisest ühelt väliselt teenuseandjalt. Kui selle teenustaja veoauto rikke tõttu välja langes, hilines vajalike osade tarne drastiliselt. Real klientidel jäi seetõttu kaup õigeaegselt kätte saamata.</li><li>Pank tellis kogu oma rahatranspordi ühelt väärisvedude ettevõttelt. See ettevõte läks aga ootamatult pankrotti. Uue ettevõttega kokkuleppimisele ja vedude plaanimisele kulus mitu päeva. Selle tulemusena tekkisid tõsised probleemid ning hilines panga filiaalide varustamine rahaga ning neist raha väljavedu.</li></ul>"
    },
    {
        "code": "G 0.12",
        "title": "Elektromagnethäired",
        "combined_title": "G 0.12: Elektromagnethäired",
        "description": "<p>Elektromagnetkiirgus võib mõjutada arvutite, võrguseadmete ja salvesti-süsteemide elektroonikadetailide tööd või neid isegi kahjustada, ja sellega põhjustada näiteks avariid, häiringuid, vääraid töötlustulemusi või sidetõrkeid.</p><p>Elektromagnetiline häiriv kiirgus võib mõjutada ka traadita sidet. Teatud juhtudel võib piisavalt tugev häiring ulatuda kasutatavate sagedusaladeni.</p><p>Elektromagnetiline häiringkiirgus võib ka kustutada või rikkuda andmekandjaile salvestatud informatsiooni, sh magneeditavaid andmekandjad (näiteks kõvakettad, magnetlindid) ja pooljuhtmälu, või kahjustada ka andmekandjat ennast.</p><p>Elektromagnetkiirgus levib nii vaakumis, õhus kui ka tahketes materjalides sh elektrijuhtides, näiteks mööda kaableid, õhukanaleid, küttetorusid.</p><p>Elektromagnetkiirguse allikaid on palju, näiteks</p><ul><li>raadiovõrgud (WLAN, Bluetooth, GSM, UMTS);</li><li>püsimagnetid;</li><li>kosmiline kiirgus;</li><li>elektriseadmed.</li></ul>"
    },
    {
        "code": "G 0.13",
        "title": "Paljastava parasiitkiirguse püük",
        "combined_title": "G 0.13: Paljastava parasiitkiirguse püük",
        "description": "<p>Informatsiooni töötlevate seadmete (näiteks arvutite, monitoride, võrguseadmete, printerite) elektromagnetkiirgus või ka helilained (näiteks printeri või klaviatuuri) võivad sisaldada hetkel töödeldavat tundlikku informatsiooni.</p><p>Sellist infokandjaks olevat kiirgust nimetatakse paljastavaks kiirguseks.</p><p>Ründaja, kes asub näiteks naaberhoones või lähedale pargitud autos, saab seda kiirgust vastu võtta ja selles sisalduva tundliku informatsiooni rekonstrueerida.Elektriseadmete elektromagnetilise ühilduvuse seadusega (EMVG) kehtestatud piirangud ei ole üldiselt piisavad paljastava kiirguse püügi tõkestamiseks.</p><p>Paljastavat kiirgust saab teatud juhtudel tekitada või tugevdada ka välise manipulatsiooniga, näiteks kiiritades seadet elektromagnetlainetega, võib tagasipeegelduvatest lainetest ekstraheerida konfidentsiaalset informatsiooni.</p>"
    },
    {
        "code": "G 0.14",
        "title": "Spionaaž",
        "combined_title": "G 0.14: Spionaaž",
        "description": "<p>Spionaaž on rünne, mille siht on koguda, analüüsida ja töödelda teavet ettevõtete, inimeste, toodete või muude sihtobjektide kohta.</p><p>Väärtusliku teabeni jõudmiseks võidakse kombineerida teavet mitmest avalikust allikast, mis eraldivõetuna ei ole konfidentsiaalsed.</p><p>Töödeldud teavet võidakse seejärel kasutada näiteks</p><ul><li>teisele ettevõttele konkurentsieeliste loomiseks;</li><li>inimeste šantažeerimiseks;</li><li>toote kopeerimiseks.</li></ul><p><b>Näiteid</b></p><ul><li>Paljud IT-süsteemid on lubamatu kasutamise eest kaitstud autentimismehhanismidega, nagu näiteks paroolkaitse. Kui aga parool edastatakse krüpteerimata kujul, võidakse see varastada.</li><li>Raha saamiseks sularahaautomaadist tuleb sisestada õige PIN-kood. Ebapiisav piilumiskaitse soodustab PIN koodi vargust ja seejärel piisab konto tühjendamiseks vaid kaardi vargusest.</li><li>E-kirjadele lisatud kasulikeks programmideks maskeeritud ründetarkvara võib anda ründajale teavet mitte ainult ühe arvuti, vaid ka kohtvõrgu kohta. Ründetarkvara eesmärk võib olla paroolide või muude pääsuandmete vargus.</li></ul>"
    },
    {
        "code": "G 0.15",
        "title": "Pealtkuulamine",
        "combined_title": "G 0.15: Pealtkuulamine",
        "description": "<p>Põhimõtteliselt on kõik sideühendused pealtkuulatavad ja erinevad ainult pealtkuulamiseks vajalike kulutuste poolest. Pealtkuulamise tuvastamine aga nõuab enamasti suuri mõõtetehnilisi kulutusi.</p><p>Eriti ohtlik on autentimisandmete kaitsetu edastus avatekstprotokollides nagu HTTP, FTP või Telnet.</p><p><b>Näiteid</b></p><ul><li>Telefonside võib sisaldada lisaks kõnele ka paroole avatekstina, mistõttu kõne pealtkuulamine võib viia volitamata juurdepääsuni.</li><li>Kaitsmata või piisamatult kaitstud raadioside korral (näiteks kui traadita kohtvõrku kaitseb ainult WEP), saab ründaja raskusteta kogu suhtlust pealt kuulata.</li><li>E-kirju saab lugeda kogu nende teekonnal läbi võrgu, kui nad ei ole krüpteeritud. Krüpteerimata e-kirja tuleks seetõttu võrrelda mitte klassikalise kirjaga, vaid postkaardiga.</li></ul>"
    },
    {
        "code": "G 0.16",
        "title": "Seadmete, andmekandjate ja dokumentide vargus",
        "combined_title": "G 0.16: Seadmete, andmekandjate ja dokumentide vargus",
        "description": "<p>Andmekandjate, IT-süsteemide, tarvikute, tarkvara või andmete vargus põhjustab asendus- ja taastuskulutusi ja halvast käideldavusest tulenevat kahju.Kui varguse tõttu paljastub konfidentsiaalne teave, võib see tuua kaasa muid kahjusid.</p><p>Peale serverite ja muude kallite IT-süsteemide varastatakse tihti ka mobiilseid IT-süsteeme, mida saab märkamatult ja hõlpsasti transportida.</p><p>On ka juhtumeid, kus sihipäraselt varastatakse andmekandjaid, näiteks dokumente või mälupulki neil oleva konfidentsiaalse teabe juurde pääsemiseks.</p><p><b>Näiteid</b></p><ul><li>Üks kõnekeskuse töötaja kopeeris vahetult enne oma vallandamist suure hulga konfidentsiaalseid kliendiandmeid. Pärast ettevõttest lahkumist müüs ta need andmed konkurendile. Kuna selle juhtumi üksikasjad sattusid ajakirjandusse, kaotas see kõnekeskus hulga olulisi kliente.</li></ul>"
    },
    {
        "code": "G 0.17",
        "title": "Seadmete, andmekandjate ja dokumentide kaotamine",
        "combined_title": "G 0.17: Seadmete, andmekandjate ja dokumentide kaotamine",
        "description": "<p>Seadmete, andmekandjate ja dokumentide kaotamine kahjustab käideldavust ja kui andmekandja ei ole täielikult krüpteeritud, ka teabe konfidentsiaalsust.</p><p>Kaotatud seadmete või andmekandjate asendamine tekitab kulusid.</p><p>Kaotatud andmekandjail olev teave võib paljastuda.</p><p><b>Näiteid</b></p><ul><li>Ühel suurüritusel pillas üks töötaja oma mapis sorides kogemata ja märkamatult põrandale mälukaardi, millel olid konfidentsiaalsed arvutused. Leidja vaatas kaardi sisu oma sülearvutis ja müüs selle teabe konkurendile.</li><li>Üks valmistaja saatis vigade kõrvaldamiseks tarkvarauuendeid CD-plaatidel posti teel oma klientidele. Mõned plaadid läksid teel kaduma, nii et saatja ega saaja ei saanud sellest teada. Tagajärjeks oli plaatideta jäänud klientide tarkvara väär töö.</li></ul>"
    },
    {
        "code": "G 0.18",
        "title": "Halb kavandamine või sobitamata jätmine",
        "combined_title": "G 0.18: Halb kavandamine või sobitamata jätmine",
        "description": "<p>Ebaotstarbekad infotöötlusprotseduurid, sh ülesannete, rollide ja vastutuse mitmetähenduslik määratlus, võivad tekitada turvaprobleeme ka siis, kui neid korrektselt täidetakse.</p><p>Infotöötlusprotseduuride tähelepanemata (kahe silma vahele jäänud) sõltuvused teistest protsessidest tekitavad samuti turvaprobleeme ja võivad põhjustada kahju.</p><p>Ebasobivate toodete valimine ja nõrkused rakenduse arhitektuuris või võrgu lahenduses võivad põhjustada turvaprobleeme.</p><p>Ohte tekitab ka organisatsiooni muutuva keskkonnaga mittearvestamine, sh töötajate lahkumine ja lisandumine, uue riistvara ja tarkvara hanked.</p><p><b>Näiteid</b></p><ul><li>Kui infotehnika soetamisel ei arvestata turvatehnilisi nõudeid, võib see suurendada IT-süsteemi rünnete riski.</li><li>Hoone ehituslike muudatuste tõttu muutuvad senised avariiteed. Kui töötajaid piisavalt ei teavitata, ei saa hoonet nõutava ajaga tühjendada.</li><li>Elektrooniliste dokumentide edastamisel ei hoolitseta selle eest, et kasutataks andmevormingut, mis vastuvõtupoolel on loetav.</li></ul>"
    },
    {
        "code": "G 0.19",
        "title": "Kaitset vajava teabe avalikustamine",
        "combined_title": "G 0.19: Kaitset vajava teabe avalikustamine",
        "description": "<p>Konfidentsiaalsed andmed (näiteks paroolid, isikuandmed, firma- või ametisaladused, arendusandmed) peavad olema juurdepääsetavad vaid volitatud isikuile.</p><p>Kandjaile (kõvaketas, mälupulk, CD- või DVD-plaat) või paberile salvestatud ning edastatavad andmed võivad paljastuda näiteks tehniliste tõrgete, tähelepanematuse või ka sihilike toimingute tõttu.</p><p>Kaitset vajava teabe paljastumine võib põhjustada seaduserikkumisi, negatiivset sisetoimet (töötajate demoraliseerimist), negatiivset välistoimet (äripartnerluse kahjustamist, klientide usalduse kaotust), rahalist toimet (kahjutasunõuded, trahvid, kohtukulud), teabelise enesemääramisõiguse rikkumist.</p><p>Konfidentsiaalsuse kadu ei märgata alati kohe, tihti ilmneb see alles hiljem, näiteks pressi järelepärimistel konfidentsiaalsele teabele ebaseadusliku juurdepääsu kohta.</p><p>Teabe paljastamise viise võib olla mitmesuguseid, näiteks</p><ul><li>lubamatu lugemine failidest;</li><li>mõtlematu edasiandmine, näiteks remonditööde käigus;</li><li>poolik andmekandjate kustutus või hävitamine;</li><li>andmekandjate vargus ja järgnev analüüs;</li><li>edastuskanalite pealtkuulamine;</li><li>IT-süsteemide nakatamine kahjurprogrammidega;</li><li>ekraani piilumine või vestluste pealtkuulamine.</li></ul><p><b>Näide</b></p><ul><li>Kasutatud arvutite, kõvaketaste, mobiiltelefonide vms seadmetega kauplejad leiavad neist väga konfidentsiaalset teavet, näiteks patsiendiandmeid või kontonumbreid.</li></ul>"
    },
    {
        "code": "G 0.20",
        "title": "Ebausaldatavast allikast pärit teave või tooted",
        "combined_title": "G 0.20: Ebausaldatavast allikast pärit teave või tooted",
        "description": "<p>Tõendamata päritoluga või lubamatust allikast pärineva tarkvara või seadme kasutamine on suur oht nii andmete konfidentsiaalsusele, terviklusele kui ka käideldavusele.</p><p>See võib viia näiteks valeandmetel või vigastel arvutustulemustel põhinevatele väärotsustele või konfidentsiaalsete andmete lekkeni.</p><p><b>Näiteid</b></p><ul><li>E-kiri, mille allikat ei ole ta saaja kontrollinud, võib sisaldada kahjurvara. E-kirja saatja andmed võivad seejuures olla võltsitud ja ta võib koguni teeselda tuntud sidepartnerit.</li><li>Internetis levitatava teabe usaldatavus on mitmesugune. Kui Internetist võetakse üle mingeid väiteid ilma täiendava allikakontrollita, võivad tulemuseks olla väärotsused.</li><li>Kui uuendeid või paiku võetakse ebausaldatavatest allikatest, võivad nad tekitada soovimatuid kõrvaltoimeid. Kui tarkvara päritolu ei kontrollita, tekib suurem risk IT-süsteemi nakatamiseks kahjurvaraga.</li></ul>"
    },
    {
        "code": "G 0.21",
        "title": "Riistvara või tarkvara manipuleerimine",
        "combined_title": "G 0.21: Riistvara või tarkvara manipuleerimine",
        "description": "<p>Riistvara või tarkvara sihipärast, kuid varjatud muutmist võidakse sooritada kättemaksuks, kahju tekitamiseks, isiklike eeliste loomiseks või kasu saamiseks.</p><p>Manipuleerimine võib olla suunatud igat liiki seadmetele, tarvikutele, andmekandjatele (näiteks DVD-dele, mälupulkadele), rakendustele, andmebaasidele vms.</p><p>Manipulatsiooni toime võib ulatuda konfidentsiaalsete andmete lekkest kuni andmekandjate või IT-süsteemide hävitamiseni, ja võivad põhjustada pikki tööseisakuid.</p><p>Manipulatsioonid on seda mõjusamad, mida hiljem nad avastatakse, mida ulatuslikumad on tegija teadmised ja mida sügavamaleulatuvam on toime tööprotsessile.</p><p><b>Näide</b></p><ul><li>Sularahaautomaatide manipuleerimisega on ründajail korduvalt õnnestunud lubamatult välja lugeda pangakaardil talletatavaid andmeid. Koos väljaluuratud PIN-koodidega saab neid andmeid hiljem kuritarvitada selle kaardiga saadava raha väljavõtuks.</li></ul>"
    },
    {
        "code": "G 0.22",
        "title": "Informatsiooni manipuleerimine",
        "combined_title": "G 0.22: Informatsiooni manipuleerimine",
        "description": "<p>Informatsiooni saab manipuleerida nii paberdokumentide või digitaalandmete otsese muutmisega kui ka informatsiooni pooliku või sihilikult väära kogumisega.</p><p>Süüdlane saab aga manipuleerida ainult seda teavet, millele tal on juurdepääs, ja seetõttu sõltuvad potentsiaalsete manipulatsioonide tagajärjed otseselt andmetele juurdepääsu ulatusest.</p><p>Kui manipulatsioone õigel ajal ei avastata, võib see oluliselt häirida äriprotsesside ja ametitööde sujuvat kulgu.</p><p>Arhiveeritud dokumentide manipuleerimisel on eriti rasked tagajärjed, sest mõnedel juhtudel võidakse see avastada alles aastaid hiljem ning taaste ei ole enam võimalik.</p>"
    },
    {
        "code": "G 0.23",
        "title": "Lubamatu sisenemine IT-süsteemidesse",
        "combined_title": "G 0.23: Lubamatu sisenemine IT-süsteemidesse",
        "description": "<p>IT-süsteemi iga liides sisaldab lisaks võimalusele seaduslikult kasutada IT-süsteemi teenuseid, ka volitamatu sisenemise riski.</p><p><b>Näiteid</b></p><ul><li>Mingi kasutajakonto ja selle juurde kuuluva parooli väljaluuramisel on mõeldav nendega kaitstavate rakenduste või IT-süsteemide lubamatu kasutamine.</li><li>Ründaja võib süsteemi tungida aktiivsete võrgukomponentide ebapiisavalt kaitstud liideste kaudu. Kui ründajal õnnestub ka lokaalsetest turvamehhanismidest mööda minna ja näiteks saada administreerimisõigus, võib ta süsteemis sisuliselt kõike teha.</li><li>Paljudel IT-süsteemidel on liidesed irdsalvestite, näiteks lisamälukaartide või USB-salvestuskandjate ühendamiseks. Järelevalveta irdsalvestiliidestega IT-süsteemist saab volitamata lugeda andmeid või süsteemi kahjurvaraga nakatada.</li></ul>"
    },
    {
        "code": "G 0.24",
        "title": "Seadmete või andmekandjate hävitus",
        "combined_title": "G 0.24: Seadmete või andmekandjate hävitus",
        "description": "<p>Hooletuse, vandalismi, ebakohase kasutamise või ka oskamatu ümberkäimise tõttu võidakse rikkuda seadmeid ja andmekandjaid, häirides sellega IT-süsteemide tööd.Seadmete ja andmekandjate hävinguga võib kaasneda olulise teabe kaotsiminek.</p><p><b>Näiteid</b></p><ul><li>Ettevõtte töötaja blokeeris olulise andmeserveri toiteploki ventilaatori tuulutuspilu. Kahe päeva pärast tekkis serveri kõvakettal temperatuurist tingitud rike ning server oli mitu päeva rivist väljas.</li><li>Töötaja, keda ärritasid süsteemi korduvad tõrked, andis oma tööarvutile jalahoobi, millega kaasnes kõvaketta kasutuskõlbmatuks muutumine. Andmed saadi eelmise päeva varukoopiast vaid osaliselt taastada.</li></ul>"
    },
    {
        "code": "G 0.25",
        "title": "Seadmete või süsteemide tõrge",
        "combined_title": "G 0.25: Seadmete või süsteemide tõrge",
        "description": "<p>Kui IT-süsteemis töötab aegkriitilisi rakendusi ja neile pole alternatiive, võivad süsteemi väljalangemisest põhjustatud sekundaarkahjud olla suured.</p><p><b>Näiteid</b></p><ul><li>IT-süsteemi paigutati püsivara, mis ei olnud mõeldud sellist tüüpi süsteemile. Seetõttu ei käivitunud IT-süsteem enam veatult ja valmistajal tuli süsteem taastada.</li><li>Netiteenusetarnijal (ISP) lülitas toitetõrge salvestisüsteemi välja. Ehkki rike ise kõrvaldati kiiresti, ei saadud IT-süsteemi failisüsteemi ebakõla tõttu enam käivitada.</li></ul><p>Selle tagajärjel olid paljud sellest tarnijast sõltuvad veebiserverid mitu päeva rivist väljas.</p>"
    },
    {
        "code": "G 0.26",
        "title": "Seadmete või süsteemide väärtalitlus",
        "combined_title": "G 0.26: Seadmete või süsteemide väärtalitlus",
        "description": "<p>Täiuslikke seadmeid ei ole olemas, ja seega tuleb igal juhul ja alati arvestada süsteemide võimaliku väärtalitlusega.</p><p>Seadmete ja süsteemide väärtalitlus võib kahjustada nii teabe konfidentsiaalsust, terviklust, kui ka käideldavust.</p><p>Väärtalitlus võib mõnikord pikemakas ajaks märkamatuks jääda ja võib näiteks juhtuda, et arvutustulemused on väärad ja neid ei parandata aegsasti.</p><p>Infotöötlusseadmed ja -süsteemid võivad sisaldada nii riistvara- kui ka tarkvaravigu, samuti võivad nende tööd häirida</p><ul><li>keskkonnatingimused;</li><li>materjalide väsimine;</li><li>valmistustolerantsid;</li><li>kontseptuaalsed nõrkused;</li><li>lubatavuspiiride ületamine;</li><li>ettearvestamatud rakendamistingimused;</li><li>puudulik hooldus.</li></ul><p><b>Näiteid</b></p><ul><li>Ummistunud tuulutusvõre tõttu kuumenes üle üks salvestisüsteem, mis ei langenud täielikult välja, vaid töötas juhuti vääralt. Alles mõne nädala pärast märgati, et talletatav teave oli puudulik.</li><li>Üht teaduseotstarbelist tüüprakendust kasutati ühe varem kogutud ja andmebaasi salvestatud andmestiku statistilise analüüsi tegemiseks. Dokumentatsiooni järgi aga ei olnud see rakendus mõeldud kasutatud andmebaasitoote jaoks. Analüüs näis küll töötavat, kuid pisteline kontroll näitas, et arvutustulemused olid valed.</li></ul><p>Väärtalitluse tegeliku põhjuse leidmiseks kulus palju aega ja ressursse.</p>"
    },
    {
        "code": "G 0.27",
        "title": "Ressursside puudumine",
        "combined_title": "G 0.27: Ressursside puudumine",
        "description": "<p>Ebapiisavad ressursid võivad viia ülekoormuste ja väljalangemisteni ja lõpptulemusena kahjustada paljusid äriprotsesse.</p><p>Ebapiisavad inim-, aja- ja raharessursse, või projektides vajatavate rollide ebasobivate töötajatega täitmine võib samuti ametitööd häirida.</p><p>Sageli võidakse personali-, aja-, raha-, tehnika- või muu nappust normaalse töö käigus veel lühiajaliselt korvata, kuid tugevama ajasurve puhul, näiteks avariiolukordades on nappus tuntavam.</p><p>Ressursid võidakse ka sihilikult üle koormata, kui keegi ettekavatsetult genereerib intensiivse nõudmise mingile töövahendile. See häirib töövahendi korrakohast kasutamist. Vt ka oht <em>G 0.40 \"Teenusetõkestus\"</em>.</p><p><b>Näiteid</b></p><ul><li>Kui uued rakendused vajavad kavandatust suuremat läbilaskevõimet, võib see võrgutaristu piisava mastaapimise võimatuse korral viia kogu võrgu käideldavuse kaoni.</li><li>Kui logifailid on sisuga ülekoormatud, saavad administraatorid infotehnoloogiat ainult osaliselt kontrollida, ja näiteks ründed võivad jääda õigeaegselt tuvastamata.</li><li>Veebiserver võidakse rohkete korraga saabuvate päringutega üle koormata, nii et korrakohane juurdepääs andmetele on peaaegu võimatu.</li></ul>"
    },
    {
        "code": "G 0.28",
        "title": "Tarkvara nõrkused või vead",
        "combined_title": "G 0.28: Tarkvara nõrkused või vead",
        "description": "<p>Mida keerukam on tarkvara, seda sagedamad on vead. Testimine ei avasta enamasti enne kliendile väljastamist kõiki vigu.</p><p>Tarkvaravead võivad viia vigaste arvutustulemusteni, juhtkonna väärotsusteni ja äriprotsesside häiringuteni.</p><p>Tarkvaravead võivad põhjustada IT-süsteemide turvaauke.</p><p><b>Näiteid</b></p><ul><li>Enamik CERT-ide hoiatusteateid on viimastel aastatel seotud turvalisust puudutavate programmivigadega, mis võimaldavad potentsiaalseil ründajail tarkvara kuritarvitada. Suur osa vigadest on seotud puhvrite ületäitumisega.</li><li>Tänapäeval on veebibrauser klientarvuti üks tähtsamaid tarkvarakomponente. Tihti kasutatakse brauserit pääsuks mitte ainult Internetti, vaid ka ettevõtte või asutuse sisemistesse veebirakendustesse. Seetõttu võivad brauseri tarkvaranõrkused või -vead teabe turvalisust tervikuna väga tugevalt kahjustada.</li></ul>"
    },
    {
        "code": "G 0.29",
        "title": "Õigusnormi või eeskirjade rikkumine",
        "combined_title": "G 0.29: Õigusnormi või eeskirjade rikkumine",
        "description": "<p>Kui organisatsiooni teave, äriprotsessid ja IT-süsteemid ei ole piisavalt kaitstud (näiteks puuduliku turbehalduse tõttu), võib see põhjustada infotöötlust puudutavate õigusaktide, sh seaduste ja määruste, või ka äripartneritega sõlmitud lepingute rikkumist.</p><p>Milliste õigusaktidega tuleb arvestada, sõltub organisatsiooni või ta äriprotsesside ja teenuste iseloomust. Peale selle tuleb sõltuvalt organisatsiooni asukohast jälgida ka kohalikke eeskirju.</p><p>Vähesed turvanõuded tulenevad otse õigusaktidest. Õigusaktides käsitletakse saavutatava turvataseme hindamise alusena üldist tehnikataset. Kui organisatsioonis rakendatavad turvameetmed ei ole kaitstavate varadega ja tehnikatasemega mõistlikus suhtes, võivad sellel olla rasked tagajärjed.</p><p><b>Näide</b></p><ul><li>Paljudes majandusharudes (näiteks autotööstuses) eeldatakse, et valmistaja nõuab oma varustajailt teatud kvaliteedi- ja turvastandardite järgimist. Üha enam esitatakse ka infoturvanõudeid. Kui lepingupartner rikub lepinguliselt määratud turvanõudeid, võib sellega kaasneda lepingutrahv või ka lepingu katkestamine.</li></ul>"
    },
    {
        "code": "G 0.30",
        "title": "Seadmete ja süsteemide lubamatu kasutus",
        "combined_title": "G 0.30: Seadmete ja süsteemide lubamatu kasutus",
        "description": "<p>Ilma sobivate pääsu reguleerimise mehhanismideta ei ole seadmete ja süsteemide volitamata kasutamine praktiliselt tõkestatav ega avastatav.</p><p>IT-süsteemides on põhilised mehhanismid kasutajate identifitseerimine ja autentimine, aga isegi tugeva autentimisfunktsiooniga IT-süsteemide volitamata kasutamine on võimalik, kui pääsuvahendid (paroolid, kiipkaardid, pääsmikud) valedesse kätesse satuvad.</p><p>Ka õiguste andmisel ja hooldamisel võidakse teha palju vigu, näiteks kui õigused on liiga laiaulatuslikud või kui neid ei uuendata õigeaegselt.</p><p>Volitamatu kasutuse tähtis erijuht on volitamata haldus. Riistvara- või tarkvarakomponentide seadistuste volitamata muutmine võib põhjustada suurt kahju.</p><p>Seadmete ja süsteemide volitamatu kasutamine võib põhjustada</p><ul><li>volitamata pääsu konfidentsiaalse teabe juurde;</li><li>andmetega manipuleerimist;</li><li>häiringuid.</li></ul><p><b>Näide</b></p><ul><li>Logiandmete kontrollimisel sattus võrguülem sündmustele, mis algul olid seletamatud ja ilmnesid eri päevadel, aga tihti varahommikul ja pärastlõunal. Lähemal uurimisel selgus, et üks traadita kohtvõrgu ruuter oli konfigureeritud ebaturvaliselt. Inimesed bussipeatuses firma hoone ees olid seda juurdepääsu kasutanud bussi oodates oma mobiilseadmetega Internetis surfimiseks.</li></ul>"
    },
    {
        "code": "G 0.31",
        "title": "Seadmete ja süsteemide väärkasutus",
        "combined_title": "G 0.31: Seadmete ja süsteemide väärkasutus",
        "description": "<p>Seadmete, süsteemide ja rakenduste väärkasutus, eriti turvameetmeid eirates, võib viia häiringute või tõrgeteni, tervikluskaoni või konfidentsiaalsete andmete lekkeni.Vead riistvara või tarkvara paigaldamisel, seadistamisel, käigushoiul ja hooldusel võivad põhjustada raskeid tagajärgi.</p><p>Ka IT-süsteemide või rakenduste väära hoolduse korral võidakse andmeid kogemata kustutada või muuta, aga ka konfidentsiaalset teavet paljastada, näiteks pääsuõiguste väära seadmisega.</p><p>Kui toite- või võrgukaabel on paigaldatud kaitsetult, võib see märkamatult kahjustuda, nii et ühendused võivad katkeda. Kui töötajad või külastajad komistavad seadmekaablitele, võivad seadmete ühendused katkeda.</p><p>Turvaintsidentideni võib viia näiteks</p><ul><li>liigsete pääsuõiguste andmine;</li><li>kergesti äraarvatav parool;</li><li>puudulikult kaitstud varukoopiad;</li><li>lukustamata terminali ajutine valveta jätmine.</li></ul>"
    },
    {
        "code": "G 0.32",
        "title": "Volituste kuritarvitus",
        "combined_title": "G 0.32: Volituste kuritarvitus",
        "description": "<p>Ühelt poolt reguleeritakse ja kontrollitakse volitustega juurdepääsu teabele, teisalt aga võimaldatakse inimestel teatud ülesandeid täita. Näiteks peavad inimestel või rühmadel olema rakenduste käituse või infotöötluse võimaldamiseks teatavad volitused.</p><p>Volituste kuritarvitus tähendab seda, et seaduslikult või ebaseaduslikult saadud võimalusi kasutatakse sihilikult väljaspool neile seatud raame. Selle eesmärgiks on tihti isikliku kasu saamine või organisatsioonile või teatavale isikule kahju tekitamine.</p><p>Tihti on inimestel ajaloolistel, süsteemitehnilistel või muudel põhjustel oma ülesannete täitmiseks vajalikest ulatuslikumad pääsuõigused. Neid õigusi võidakse teatud juhtudel kuritarvitada ründeks.</p><p><b>Näiteid</b></p><ul><li>Mida peenemalt on liigendatud õigused juurdepääsuks teabele, seda keerulisem on neid ajakohasena hoida. Seetõttu on oht, et pääsuõiguste andmisel eristatakse rolle liiga vähe ning hõlbustatakse seeläbi volituste kuritarvitust.</li><li>Mitmesuguste rakenduste puhul hoitakse pääsuvolitusi või paroole süsteemitsoonis, kuhu on juurdepääs ka teistel kasutajatel. Seeläbi saab ründaja muuta volitusi või lugeda paroole.</li><li>Liiga lahkelt antud volitustega isikud võivad mingit teavet tungivalt vajades püüda pääseda võõraste failide juurde, näiteks lugeda võõrast e-posti.</li></ul>"
    },
    {
        "code": "G 0.33",
        "title": "Personali puudumine",
        "combined_title": "G 0.33: Personali puudumine",
        "description": "<p>Personali väljalangemisel võivad olla tõsised tagajärjed organisatsioonile ja ta äriprotsessidele.</p><p>Personal võib välja langeda sisemise töökohtade ümberkorralduse tõttu. Personalikaotus võib olla tingitud põhipuhkustest, edasiõppest või korralisest töösuhte lõpetamisest.</p><p>Personal võib ettenägematult välja langeda näiteks järgmistel põhjustel:</p><ul><li>streik;</li><li>haigus;</li><li>õnnetus;</li><li>surm.</li></ul><p><b>Näiteid</b></p><ul><li>Ühe firma võrguülem jäi pikema haiguse tõttu töölt ära. Võrk töötas selles firmas peaaegu veatult edasi. Kahe nädala pärast aga toimus süsteemi avarii, aga keegi ei saanud riket kõrvaldada, sest selleks oli vaja võrgukäituses kogenud administraatorit. Tulemusena oli võrk mitu päeva maas.</li><li>Administraatori puhkuse ajal oli ühes organisatsioonis vaja varundushoidlast võtta varukoopia kandja, kuid hoidla pääsukoodi oli alles hiljuti muudetud ja seda teadis ainult administraator. Andmed saadi taastada alles mitme päeva pärast, sest varem ei saadud puhkusel olevat administraatorit kätte.</li></ul>"
    },
    {
        "code": "G 0.34",
        "title": "Rünne",
        "combined_title": "G 0.34: Rünne",
        "description": "<p>Füüsiline rünne võib ähvardada organisatsiooni, selle teatud osi või üksikisikuid.</p><p>Kas ja mil määral ohustab organisatsiooni füüsiline rünne, sõltub lisaks hoone asukohast ja ümbruskonnast tugevalt ka organisatsiooni ülesannetest ning poliitilisest ja sotsiaalsest kliimast. Teistest rohkem on ohus ettevõtted ja asutused, mis tegutsevad poliitiliselt vaieldavatel aladel.</p><p>Poliitiliselt motiveeritud ohu hindamiseks või ohukahtluse korral võib Eestis pöörduda konsulteerimiseks Politsei- ja Piirivalveameti poole.</p><p>Füüsilise ründe võimalusi on mitmesuguseid, näiteks</p><ul><li>telliskivi viskamine;</li><li>lõhkeaine plahvatus;</li><li>tulirelva kasutamine;</li><li>süütamine.</li></ul><p><b>Näiteid</b></p><ul><li>Maailma Kaubanduskeskuse ründamisel New Yorgis 11. septembril 2001 hukkus hulk inimesi, kuid hävis ka hulk IT-süsteeme. Selle tulemusena oli paljudel ettevõtetel tõsiseid raskusi oma äritegevuse jätkamisega.</li></ul>"
    },
    {
        "code": "G 0.35",
        "title": "Sundus, väljapressimine ja korruptsioon",
        "combined_title": "G 0.35: Sundus, väljapressimine ja korruptsioon",
        "description": "<p>Sundus, väljapressimine või korruptsioon võivad viia teabe turvalisuse või äriprotsesside kahjustamiseni.</p><p>Ründaja võib sihipäraselt pakkuda töötajaile või muudele isikutele raha või muud kasu, et muuta nad turvarikete instrumendiks (korruptsioon). Eriti ohtlikud on kõrgematele juhtidele või erilise usalduspositsiooniga isikute vastu suunatud ründed.</p><p>Vägivalla või mingi kahjuga ähvardades (st sundusega) võib ründaja näiteks püüda panna ohvrit</p><ul><li>turvapoliitikat eirama või turvameetmetest mööda hiilima;</li><li>konfidentsiaalset teavet volitamatult edastama;</li><li>elutähtsat teavet manipuleerima;</li><li>äriprotsesside sujuvat kulgemist häirima.</li></ul><p><b>Näide</b></p><ul><li>Äraostetud töötaja andis lubamatult edasi konfidentsiaalseid dokumente.</li></ul>"
    },
    {
        "code": "G 0.36",
        "title": "Identiteedivargus",
        "combined_title": "G 0.36: Identiteedivargus",
        "description": "<p>Ründaja esineb teise isikuna, kasutades kättesaadavaid isikuandmeid nagu sünnikuupäeva, postiaadressi, krediitkaardi- või kontonumbrit, näiteks teiste kulul netiteenustaja juures registreerimiseks või mingil muul viisil kasu saamiseks.</p><p>Nimevargus viib tihti otse või kaudselt mainekaotuseni, kuid põhjustab ka suurt ajakulu põhjuse väljaselgitamiseks ja ohvrit ähvardavate negatiivsete tagajärgede vältimiseks.</p><p>Mõningaid nimevarguse vorme nimetatakse ka teeskluseks.</p><p>Nimevargust tuleb eriti tihti ette siis, kui identiteeti kontrollitakse hoolimatult ja eelkõige siis, kui sellel põhinevad kallid teenused.</p><p><b>Näiteid</b></p><ul><li>Internetiteenustesse registreerumiseks tuleb sageli valida endale kasutajanimi ning esitada see koos pärisnime, aadressiga, pangakontoga jms. Ründaja võib end registreerida teise isiku andmetega valides kasutajanimeks mingi koomiksitegelase. Kui teenuses rakendatakse rangemat kontrolli, kasutatakse selleks ka pärisnime, aadressi ja pangakontot. Ohver saab sellest teada alles siis, kui saab esimese maksekorralduse.</li><li>Meili saatja aadressi on kerge võltsida. Üha juhtub, et kasutajaid sel viisil petetakse uskuma, et e-kiri tuleb usaldatavalt sidepartnerilt. Analoogilised ründed on võimalikud helistaja numbri esituse manipuleerimisega kõnesides või saatja identifikaatori manipuleerimisega faksiühenduses.</li><li>Ründaja võib teesklusega püüda tungida juba loodud ühendusse, ilma et peaks end autentima, sest selle sammu tegi läbi algne sidepool.</li></ul>"
    },
    {
        "code": "G 0.37",
        "title": "Toimingute salgamine",
        "combined_title": "G 0.37: Toimingute salgamine",
        "description": "<p>Inimesed võivad mitmesugustel põhjustel eitada toimingute teostamist või sõnumi kättesaamist, näiteks siis kui on rikutud eeskirju, norme või õigusakte.</p><p>Infoturbe alal rõhutatakse siinjuures tihti siduvust, st omadust, millega tuleb tagada, et tulenevatest toimingutest ebaseaduslikult ei taganetaks (ingl <em>non-repudiation</em>, salgamatus).</p><p>Suhtluse puhul eristatakse veel seda, kas suhtlusosaline salgab sõnumi vastuvõttu (ingl <em>repudiation of receipt</em>) või saatmist (ingl <em>repudiation of origin</em>).</p><p>Vastuvõtu salgamisel võib muuhulgas olla tähendus rahaliste tehingute puhul, näiteks kui keegi eitab arve õigeaegset saamist.</p><p><b>Näide</b></p><ul><li>Tungivalt vajalik varuosa telliti elektrooniliselt. Nädala pärast esitati kaebus tarne puudumise kohta, kusjuures tootmisseisak tekitas suuri kulusid. Tarnija aga eitas tellimuse saamist.</li></ul>"
    },
    {
        "code": "G 0.38",
        "title": "Isikuandmete väärkasutus",
        "combined_title": "G 0.38: Isikuandmete väärkasutus",
        "description": "<p>Kui isikuandmete kaitse ei ole piisavalt tagatud, ähvardab oht kahjustada selle isiku ühiskondlikku positsiooni või majandussuhteid.</p><p>Isikuandmete väärkasutus võib esineda näiteks siis, kui organisatsioon</p><ul><li>kogub liiga palju isikuandmeid;</li><li>hangib isikuandmeid ilma seadusliku aluseta või isiku nõusolekuta;</li><li>kasutab isikuandmeid muuks kui hankimisel lubatud otstarbeks;</li><li>kustutab isikuandmeid liiga hilja;</li><li>annab isikuandmed lubamatult edasi.</li></ul><p><b>Näiteid</b></p><ul><li>Isikuandmeid tohib kasutada ainult selleks otstarbeks, milleks nad hangiti või esmakordselt salvestati. Seetõttu on lubamatu kasutada kohaloleku ja käitumise kontrolliks logiandmeid, milles jäädvustatakse kasutajate sisselogimised IT-süsteemidesse ja sealt väljalogimised eranditult pääsu reguleerimiseks.</li><li>Isikud, kellel on juurdepääs isikuandmetele, ei tohi neid volitamatult edasi anda. Näiteks ei tohi hotelli vastuvõtutöötajad müüa külastajate registreerimisandmeid reklaamifirmadele.</li></ul>"
    },
    {
        "code": "G 0.39",
        "title": "Kahjurprogrammid",
        "combined_title": "G 0.39: Kahjurprogrammid",
        "description": "<p>Kahjurprogramm on programm, mis on loodud eesmärgiga täita lubamatuid ja enamasti kahjulikke ülesandeid. Kahjurprogrammide tüüpiliste liikide hulka kuuluvad näiteks viirused, ussid ja troojanid. Kahjurprogrammid on enamasti salajased ning tegutsevad kasutaja teadmata ja tahtmata.</p><p>Tänapäeval pakuvad kahjurprogrammid ründajaile ulatuslikke side- ja juhtimisvõimalusi ning neil on palju funktsioone. Muuhulgas suudavad kahjurprogrammid sihipäraselt paroole välja uurida, süsteeme kaugjuhtida, turvatarkvara deaktiveerida ja andmeid püüda.</p><p>Kahjustusteks on siin eelkõige tähtsate andmete või rakenduste kadu või võltsimine. Aga suur tähtsus on ka kahjurprogrammide tõttu tekkida võival mainekaotusel ja rahalisel kahjul.</p><p><b>Näide</b></p><ul><li>Kahjurprogramm W32/Klez levis mitme variandina. Vallutatud arvuti saatis selle viiruse kõigile oma aadressiraamatus olevatele saajatele. Kui see viirus sattus mingisse arvutisse, manipuleeris ta operatsioonisüsteemi, takistades levinud viirusetõrjeprogrammide installeerimist ning raskendas selle arvuti desinfitseerimist tunduvalt.</li></ul>"
    },
    {
        "code": "G 0.40",
        "title": "Teenusetõkestus",
        "combined_title": "G 0.40: Teenusetõkestus",
        "description": "<p>On hulk ründevorme, mis on suunatud sellele, et takistada teatavate teenuste, funktsioonide või seadmete normaalset kasutamist. Sellise ründe üldnimetus on teenusetõkestus (denial of service), sageli ka DoS-rünne, ummistusrünne.</p><p>Selliste rünnete tekitajaiks võivad muuhulgsas olla pettunud töötajad või kliendid, aga ka konkurendid, väljapressijad või poliitiliselt motiveeritud tegijad. Ründe sihtmärgiks võib olla igasugune ärilise väärtusega vara.</p><p>Sedalaadi ründed on tihti seotud ühisressurssidega, kusjuures ründaja võtab need ressursid nii tugevalt oma käsutusse, et nad ei ole enam tegelikeks vajadusteks kasutatavad. IT-põhised ründed võivad tekitada kunstliku nappuse näiteks protsesside, protsessoriaja, töömälu, kettaruumi või edastusmahu osas.</p><p>Tüüpilised ummistusründe ilmingud on</p><ul><li>äriprotsesside häiringud, näiteks tellimuste vastuvõtu ülekoormamine võltstellimustega;</li><li>taristu kahjustamine, näiteks organisatsiooni uste blokeerimisega;</li><li>IT-tõrgete esilekutsumine, näiteks serveri teenuste sihiliku ülekoormamisega.</li></ul>"
    },
    {
        "code": "G 0.41",
        "title": "Sabotaaž",
        "combined_title": "G 0.41: Sabotaaž",
        "description": "<p>Sabotaaž on objektide või protsesside kuritahtlik manipuleerimine või rikkumine eesmärgiga tekitada ohvrile kahju. Eriti atraktiivsed sihtmärgid võivad olla asutuse või ettevõtte arvutikeskused või sidekanalid, sest siin saab suhteliselt väheste vahenditega saavutada ränga tagajärje.</p><p>Käitushäiringute esilekutsumiseks saavad arvutikeskuse kogu keerukat taristut oluliste komponentide sihipärase mõjutamisega väga täpselt manipuleerida kohati ka välised, eelkõige aga sisemised tegijad.</p><p>Eriti puudutab see puudulikult kaitstud hoonetehnilist ja sidetehnilist taristut ning tsentraalseid varustussõlmi, mis korralduslikel või tehnilistel põhjustel võivad olla ka järelevalveta ning kõrvalistele kergelt ja märkamatult kättesaadavad.</p><p><b>Näiteid</b></p><ul><li>Ühes suures arvutikeskuses viis puhvertoiteallika (upsi) manipuleerimine ajutise täieliku välja-lülituseni. Süüdlane oli korduvalt puhvertoidet käsitsi blokeerinud ja seejärel hoone peatoidet manipuleerinud. Kokku toimus kolme aasta jooksul neli väljalangemist, osalt sai kahjustada ka seadmestik. Tööseisakud kestsid 40 kuni 130 minutit.</li><li>Ühte arvutikeskusesse olid paigutatud ka sanitaarsüsteemid. Kui äravool suleti ja samal ajal vee juurdevool avati, voolas vesi tsentraalsetesse tehnilistesse komponentidesse. Sellega põhjustatud kahjustused viisid tootmissüsteemide tööseisakuni.</li><li>Elektroonilisele arhiivile kujutab sabotaaž erilist riski, sest siin hoitakse paljusid kaitseväärseid dokumente enamasti väikeses ruumis. Seega saab teatud juhtudel sihikindlate lihtsate manipulatsioonidega tekitada suurt kahju.</li></ul>"
    },
    {
        "code": "G 0.42",
        "title": "Psühholoogiline manipuleerimine",
        "combined_title": "G 0.42: Psühholoogiline manipuleerimine",
        "description": "<p>Psühholoogiline manipuleerimine on meetod teabele või IT-süsteemidele lubamatu juurdepääsu saamiseks kasutades ära inimlikke omadusi nagu abivalmidus, usaldus, hirm või aukartus ning manipuleeritakse töötajaid tegema lubamatut.</p><p>Psühholoogilise manipuleerimise üks strateegiatest on pikema suhte loomine ohvriga, mille käigus kogub ründaja teadmisi ning loob usaldust, mida ta saab hiljem ära kasutada.</p><p>Psühholoogilise manipuleerimise käigus ei ilmuta ründaja end alati nähtavalt ja sageli ei aimagi ohver enda ära kasutamist, mistõttu ründaja ei pea kartma juurdlust ja lisaks saab ta allika, kust ka hiljem teavet võib hankida.</p><p>Ründaja sooritatavat lubamatut paroolide või muude autentimisvahendite väljauurimist nimetatakse tihti ka kalastuseks või õngitsemiseks (phishing, sõnadest <em>password</em> ja <em>fishing</em>).</p><p><b>Näiteid</b></p><ul><li>Ründaja esineb sekretärina, kelle ülemus tahab kiiresti midagi teha, aga on oma parooli unustanud ja vajab seda nüüd tungivalt.</li><li>Ründaja esineb administraatorina, kes helistab ühe süsteemivea pärast, mille kõrvaldamiseks olevat vaja kasutaja parooli.</li><li>Paljud kasutajad kasutavad küll tugevat parooli, kuid sama parooli mitme kontoga. Kui ründaja kasutab ära mingi vajaliku võrguteenuse (näiteks meili aadressisüsteemi), mille saamiseks peab kasutaja end autentima, jõuab ta soovitud paroolide ja sisselogimisteni. Selle teenuse sisselogimisandmeid kasutavad paljud ka muude teenuste puhul.</li></ul>"
    },
    {
        "code": "G 0.43",
        "title": "Sõnumite süstimine",
        "combined_title": "G 0.43: Sõnumite süstimine",
        "description": "<p>Ründaja saadab süsteemidele või isikutele spetsiaalse sisuga sõnumeid kas kasu saamiseks või ohvrile kahju tekitamiseks, kasutades ära näiteks liideste kirjeldusi, protokollide spetsifikatsioone või eelnenud sidetoimingute jäädvustusi.</p><p>Side krüpteerimine ei kaitse vahendusründe eest, kui ei toimu sidepartneri turvalist autentimist.</p><p>Sõnumite süstimisel on kaks olulist erijuhtu: taasesitus- ja vahendusrünne.</p><p>Taasesitusründe (ingl <em>message replay</em>, sõnumite taasesituse) puhul salvestab ründaja ehtsaid sõnumeid ja esitab seda teavet kunagi hiljem uuesti.</p><p>Vahendusründe (ingl <em>man-in-the-middle-attack</em>) puhul asub ründaja märkamatult vahenduspositsioonile osaliste vahelises suhtluses, simuleerides seal enamasti sõnumi saatjale tegelikku saajat, saajale aga tegelikku saatjat. Kui see õnnestub, saab ründaja võtta vastu sõnumeid, mis pole talle määratud, ja neid enne edasisaatmist tegelikule saajale analüüsida ja sihipäraselt manipuleerida.</p><p><b>Näiteid</b></p><ul><li>Kasutaja sisselogimise käigus uurib ründaja välja ta autentimisandmed (näiteks kasutajanime ja parooli) ning kasutab seda teavet mingile süsteemile juurdepääsu saamiseks. Kui autentimisprotokoll on puhtstaatiline, saab lubamatuks võõrasse süsteemi sisenemiseks kasutada ka krüpteeritult edastatud parooli.</li><li>Tööandjale (ettevõttele või asutusele) rahalise kahju tekitamiseks saatis töötaja ühe kinnitatud tellimuse välja korduvalt.</li></ul>"
    },
    {
        "code": "G 0.44",
        "title": "Lubamatu sisenemine ruumidesse",
        "combined_title": "G 0.44: Lubamatu sisenemine ruumidesse",
        "description": "<p>Lubamatult hoonesse või territooriumile sisenejad võivad tuua kaasa mitmesuguseid muid ohte, näiteks teabe või IT-süsteemide vargust või manipuleerimist.Oskuslike rünnete puhul on otsustav see ajavahemik, mille vältel saab ründaja segamatult ja sihipäraselt tegutseda.</p><p>Tihti varastab ründaja väärtuslikke IT-komponente või muid varasid, mida on kerge müüa, kuid sissemurdmise eesmärgiks võib muuhulgas olla ka konfidentsiaalse teabe juurde pääsemine, manipulatsioonide tegemine või äriprotsesside häirimine.</p><p>Territooriumile loata sisenemine tekitada mitut liiki kahju.</p><ul><li>Akende ja/või uste vägivaldne avamine kahjustab neid ning nad tuleb parandada või asendada.</li><li>Varastatud, kahjustatud või hävitatud seadmed või komponendid tuleb parandada või asendada.</li><li>Kahju võib tekkida teabe või rakenduste konfidentsiaalsuse, tervikluse või käideldavuse rikkumisest.</li></ul><p><b>Näide</b></p><ul><li>Ettevõttesse nädalavahetusel sissemurdmisel tekitati ainult tühist kahju akna avamisega ning varastati ainult kohvikassa ja väikesi tarbeesemeid. Hiljem aga tegi korraline kontroll kindlaks, et just selle sissetungi ajal oli manipuleeritud keskserverit.</li></ul>"
    },
    {
        "code": "G 0.45",
        "title": "Andmekaotus",
        "combined_title": "G 0.45: Andmekaotus",
        "description": "<p>Andmekaotus on sündmus, mis viib selleni, et andmestikku ei saa enam kasutada nii, nagu on vaja (käideldavuse kadu).</p><p>Üks sage andmekaotuse liik on andmete ettevaatamatu või lubamatu kustutus, näiteks vale hoolduse, väärtalitluse, toitekatkestuse, saaste või kahjurvara tõttu.</p><p>Andmed võivad aga kaotsi minna ka seadmete või andmekandjate kahjustuse, kaotamise või varguse tõttu. Eriti suur on see risk mobiilseadmetel ja mobiilsetel andmekandjatel.</p><p>Tuleb arvestada, et paljud mobiilseadmed ei ole alati võrgus, mistõttu ei ole nendes süsteemides hoitavate andmete seis mitte alati ajakohane. Mobiilsete IT-süsteemide ja statsionaarsete IT-süsteemide andmeseisude sünkroniseerimisel võivad tähelepanematuse või väärtalitluse tõttu andmed kaotsi minna.</p><p><b>Näiteid</b></p><ul><li>Pihuarvuti kukkus rinnataskust välja ja purunes teeplaatidel, ajalehe asemel tõi koer mobiiltelefoni, kuid kahjuks rikutult. Need ja selletaolised sündmused on mobiilseadmete paljude täielike andmekaotuste põhjuseks.</li><li>Teabe võrkusalvestuseks saab kasutada paljusid netiteenuseid. Kui parool unustatakse ja ei ole salvestatud, võib juhtuda, et salvestatud teabe juurde enam ei pääse, kui teenuseandjal pole pakkuda mingit sobivat protseduuri parooli taastamiseks.</li><li>Kõvaketaste ja muude massmälude eluiga on piiratud. Kui ei rakendata mingeid sobivaid liiasusmeetmeid, võib tehniline defekt tekitada andmekaotuse.</li></ul>"
    },
    {
        "code": "G 0.46",
        "title": "Kaitsetarbega informatsiooni tervikluse kadu",
        "combined_title": "G 0.46: Kaitsetarbega informatsiooni tervikluse kadu",
        "description": "<p>Teabe tervikluse kahjustumisel võivad olla mitmed põhjused, näiteks manipulatsioonid, inimeste väär käitumine, rakenduste väär hooldus, tarkvara väärtalitlus või edastusvead, andmete sisestusvead, kahjurprogrammid.</p><p>Ründaja võib püüda manipuleerida andmeid oma eesmärkidel, näiteks et saada juurdepääsu teistele IT-süsteemidele või andmestikele.</p><p>Indeksiandmebaasi manipuleerides võib lasta elektronarhiivil võltsdokumente arhiveerida või välja anda.</p><p>Tervikluskadu võib põhjustada:</p><ul><li>väärteabe väljaandmist;</li><li>vigaseid pangaülekandeid;</li><li>andmekadu.</li></ul><p><b>Näide</b></p><ul><li>Kui krüpteerimisvõtmes muuta kasvõi ainsat bitti, ei saa andmeid enam dekrüpteerida ega nende autentsust kontrollida. Näiteks elektroonilistes arhiivides hoitavad dokumendid kaotavad nii oma tõendusjõu.</li></ul>"
    },
    {
        "code": "G 0.47",
        "title": "IT-põhiste rünnete kahjulikud kõrvaltoimed",
        "combined_title": "G 0.47: IT-põhiste rünnete kahjulikud kõrvaltoimed",
        "description": "<p>IT-põhistel rünnetel võib olla toimeid, mida ründaja ei ole kavatsenud või mis ei ilmne otseselt ründe sihtobjektil või mis kahjustavad kolmandaid isikuid.</p><p>Põhjuseks on siin nüüdisaegse infotehnoloogia keerukus ja võrgustatus, samuti asjaolu, et sõltuvused rünnatava sihtobjekti ja temaga seotud protsesside vahel ei ole enamasti silmnähtavad.</p><p>Seetõttu võib muuhulgas juhtuda, et sihtobjekti tegelikku kaitsetarvet hinnatakse valesti või et sihtobjekti eest vastutaja ei ole ise huvitatud selle sihtobjekti puuduste kõrvaldamisest.</p><p><b>Näiteid</b></p><ul><li>IT-süsteemidesse installitud botid, millega ründaja saab sooritada hajusaid ummistusründeid (DDoS), ei kujuta endast mingit otsest ohtu nakatatud IT-süsteemile, sest ummistusrünne on enamasti suunatud kolmandatele IT-süsteemidele.</li><li>Traadita kohtvõrgus olevate esemevõrguseadmete nõrkusi saab ründaja kasutada väravana teiste oluliste seadmete ründamiseks samasuguses kohtvõrgus. Seetõttu tuleb niisuguseid esemevõrgu seadmeid kaitsta ka siis, kui nende endi kaitsetarve on väike.</li><li>IT-süsteemide lunavararünded võivad teatud juhtudel vallandada ahelreaktsioone ning nii ka elutähtsa taristuni jõuda. See omakorda võib tekitada elanikele varustamisraskusi ka siis, kui ründaja neid võib-olla ei taotlenud.</li></ul>"
    }
]